Конфигурация/src/DataProcessors/РаботаСЗапросами/РаботаСЗапросами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗапросами</name>
</mdclass:DataProcessor>

Конфигурация/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/DataProcessors/РаботаСЗапросами/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код КАК КодТовара,
		|	Номенклатура.Наименование,
		|	Номенклатура.Родитель,
		|	Номенклатура.ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.ЦенаЗакупки,
		|	СпрНоменклатура.Код,
		|	СпрНоменклатура.Наименование
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ЦеныСрезПоследних.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СпрНоменклатура.Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяМатериалы.Ссылка.Дата,
		|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер,
		|	ПриходнаяНакладнаяМатериалы.Материал
		|ПОМЕСТИТЬ ВТ_Материалы
		|ИЗ
		|	Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
		|ГДЕ
		|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер = &НомерНакладной
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Материалы.Дата,
		|	ВТ_Материалы.Номер,
		|	Номенклатура.Наименование КАК Материал
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Материалы КАК ВТ_Материалы
		|		ПО Номенклатура.Ссылка = ВТ_Материалы.Материал
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос2.УстановитьПараметр("НомерНакладной", "000000001");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		 | ПриходнаяНакладнаяМатериалы.Материал,
		 | ПриходнаяНакладнаяМатериалы.Ссылка.Дата,
		 | ПриходнаяНакладнаяМатериалы.Ссылка.Номер
		 |ИЗ
		 | Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
		 |ГДЕ
		 | ПриходнаяНакладнаяМатериалы.Ссылка.Номер = &НомерНакладной";
	
	Запрос.УстановитьПараметр("НомерНакладной", "000000001");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 //Сообщить("Материал: " + Выборка.Материал + 
		 // " из документа номер: " + Выборка.Номер +
		 //" от " + Формат(Выборка.Дата, "ДЛФ=D;"));
	КонецЦикла; 
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц; 
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяМатериалы.Материал,
		|	ПриходнаяНакладнаяМатериалы.Ссылка.Дата,
		|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер
		|ПОМЕСТИТЬ НакладнаяМатериалы
		|ИЗ
		|	Документ.ПриходнаяНакладная.Материалы КАК ПриходнаяНакладнаяМатериалы
		|ГДЕ
		|	ПриходнаяНакладнаяМатериалы.Ссылка.Номер = &НомерНакладной";
	
	Запрос.УстановитьПараметр("НомерНакладной", "000000001");
	
	Запрос.Выполнить(); 
	
	Запрос2 = Новый Запрос; 
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос2.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
 		| 	Номенклатура.Наименование КАК Наименование,
 		| 	ЕСТЬNULL(НакладнаяМатериалы.Дата, 0) КАК Дата,
 		| 	ЕСТЬNULL(НакладнаяМатериалы.Номер, 0) КАК Номер
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ НакладнаяМатериалы КАК НакладнаяМатериалы
		|		ПО Номенклатура.Ссылка = НакладнаяМатериалы.Материал
		//|ГДЕ
		//|	Номенклатура.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Ссылка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ"; 
	
	РезультатЗапроса = Запрос2.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать(); 
	
	// Посмотреть результат запроса в отладчике можно:
	// Установить точку останова на инструкции ТЗ (снять отметку комментария)
	//	 и запустить проект в режиме отладки.
	// ТЗ = РезультатЗапроса.Выгрузить();
		
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ЭтоГруппа Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Группа: " + Выборка.Наименование;
			Сообщение.Сообщить();
		ИначеЕсли выборка.Дата = 0 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "материал: " + Выборка.Наименование + " поступлений нет.";
			Сообщение.Сообщить();
		Иначе	
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Номенклатура: " + Выборка.Наименование + 
		 		" из документа номер: " + Выборка.Номер +
		 		" от " + Формат(Выборка.Дата, "ДЛФ=D;");
			Сообщение.Сообщить();
		КонецЕсли;
				
	КонецЦикла; 	

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
